Repository: Georgi-Ginduzov/Internships-tasks
Catalog: HitachiSpaceProgram/SpaceShuttleLaunch/Localization/Resources/Resources.*.resx
Languages: de

# CannotBeNull
source: {0} cannot be null. Please try again.
de: {0} darf nicht null sein. Bitte versuche es erneut.

# ClientNotPermitted
source: The client was not permitted to send the email.
de: Der Kunde durfte die E-Mail nicht versenden.

# CsvError
source: An error occurred while reading to the CSV file: {0}
de: Beim Lesen der CSV-Datei ist ein Fehler aufgetreten: {0}

# CsvFileFormatException
source: A format error occurred while parsing the data: {0}
de: Beim Parsen der Daten ist ein Formatfehler aufgetreten: {0}

# DataParsingError
source: An overflow error occurred while parsing the data: {0}
de: Beim Parsen der Daten ist ein Überlauffehler aufgetreten: {0}

# DirectoryNotFoundException
source: The current directory does not exist.
de: Die E-Mail wurde nicht gesendet. Bitte versuche es erneut.

# EmailNotSentError
source: An error occurred while sending the email: {0}
de: Die E-Mail wurde nicht gesendet. Bitte versuche es erneut.

# EnterInputFolderPath
source: Enter the path to the folder on the file system:
de: Geben Sie den Pfad zum Ordner im Dateisystem ein:

# EnterInputRecipientEmail
source: Enter the recipient email:
de: Geben Sie die E-Mail-Adresse des Empfängers ein:

# EnterInputSenderEmail
source: Enter the sender email:
de: Geben Sie die E-Mail-Adresse des Absenders ein:

# EnterInputSenderPassword
source: Enter the sender password:
de: Geben Sie das Absenderpasswort ein:

# ErrorWritingToFile
source: An error occurred while writing to the CSV file.
de: Beim Schreiben in die CSV-Datei ist ein Fehler aufgetreten.

# ExceededStorageAllocation
source: The email is too large to fit in the recipient's mailbox.
de: Die E-Mail ist zu groß, um in das Postfach des Empfängers zu passen.

# FileAlreadyOpen
source: The file is already open in another process.
de: Die Datei ist bereits in einem anderen Prozess geöffnet.

# GeneralFailure
source: General failure when sending the email.
de: Allgemeiner Fehler beim Senden der E-Mail.

# InvalidEmail
source: Invalid email address! Please try again:
de: Ungültige E-Mail-Adresse! Bitte versuche es erneut:

# InvalidPassword
source: Invalid password! Please try again.
de: Ungültiges Passwort! Bitte versuche es erneut.

# InvalidRecipientEmail
source: Invalid recipient email address! Please try again:
de: Ungültige Empfänger-E-Mail-Adresse! Bitte versuche es erneut:

# IOError
source: An IO error occurred: {0}
de: Es ist ein E/A-Fehler aufgetreten: {0}

# IsEmpty
source: {0} is empty. Please try again.
de: {0} ist leer. Bitte versuche es erneut.

# MailboxBusyOrUnavailable
source: The recipient's mailbox is busy or unavailable.
de: Das Postfach des Empfängers ist belegt oder nicht verfügbar.

# MaxAttemptsReached
source: You have reached the maximum number of attempts. Please try again later.
de: Sie haben die maximale Anzahl an Versuchen erreicht. Bitte versuchen Sie es später noch einmal.

# ModelCannotBeNull
source: Model doesn't exist! It cannot be null.
de: Modell existiert nicht! Es darf nicht null sein.

source: No forecasts available.
de: Keine Prognosen verfügbar.

# NotADailyForecast
source: Object is not a DailyForecast.
de: Das Objekt ist kein DailyForecast.

# NotEnoughDiskSpace
source: There is not enough disk space to create or write to the file.
de: Es ist nicht genügend Speicherplatz zum Erstellen oder Schreiben der Datei vorhanden.

# PathIncorrect
source: {0} path is not valid.
de: {0}-Pfad ist ungültig.

# PreferredLanguage
source: Enter the preferred language:
de: Geben Sie die bevorzugte Sprache ein:

# TransactionFailed
source: The email transaction failed.
de: Die E-Mail-Transaktion ist fehlgeschlagen.

# WelcomeMessage
source: Welcome to the Space Shuttle Launch Program!
de: Willkommen beim Space-Shuttle-Startprogramm!
